GabyGold67/SevenSegDisplays_STM32/src/sevenSegDisplays.h
     * @param newBlnkMsk A pointer to a boolean array the size of DigitsQty long, the first element of the array corresponding to the leftmost display port, the following element representing the next display port to it's left. A true value in the array element will set the corresponding display port to blink when the blink() methods are invoked, a false will make it's displayed value steady.
     */
    void setBlinkMask(const bool* newBlnkMsk);
    /**
     * @brief Changes the time parameters to use for the display blinking the contents it shows.
     *
     * The parameters change will take immediate effect, either if the display is already blinking or not, in the latter case the parameters will be the ones used when a blink() method is called without parameters. The blinking will be **symmetrical** if only one parameter is passed, **asymmetrical** if two different parameters are passed, meaning that the time the display shows the contents and the time the display is blank will be equal (symmetrical) or not (asymmetrical), depending of those two parameters. The blink rate set will be kept after a `noBlink()` or new `blink()` without parameters call is done, until it is modified with a new `setBlinkRate()` call, or it is restarted by a `blink()` with parameters.
     *
     * @note To restart the blinking with a `blink()` the service must first be stopped, as the method makes no changes if the blinking service was already running.
     *
     * @param newOnRate Contains the time (in milliseconds) the display must stay on, the value must be in the range minBlinkRate <= onRate <= maxBlinkRate. Those built-in values can be known by the use of the `getMinBlinkRate()` and the `getMaxBlinkRate()` methods.
     * @param newOffRate (Optional) Contains the time (in milliseconds) the display must stay off, the value must be in the range minBlinkRate <= offRate <= maxBlinkRate. Those built-in values can be known by the use of the `getMinBlinkRate()` and the `getMaxBlinkRate()` methods. If no offRate value is provided the method will assume it's a symmetric blink call and use a value of offRate equal to the value passed by onRate.
     *
     * @retval true: If the parameter or parameters passed are within the valid range, and the change will take effect immediately.
	  * @retval false: One or more of the parameters passed were out of range. The rate change would not be made for none of the parameters.
     *
     */
    bool setBlinkRate(const unsigned long &newOnRate, const unsigned long &newOffRate = 0);
    /**
     * @brief Sets the character to use when the display is in **wait mode**.
     *
     * The parameters change will take immediate effect, either if the display is already in wait mode or not. The new character will be changed for further calls of the method until a new setWaitChar() is invoked with a valid argument.
     *
     * @param newChar A character the display must use for symbolizing the progress, the value must be in the displayable characters list as explained in the print(std::string) method.
     *
     * @retval true: If the character passed is whitin the displayable characters range, and the change will take effect immediately.
     * @retval false: The parameter passed was invalid, i.e. it was a non displayable character. In this case the character change will fail.
     */
    bool setWaitChar (const char &newChar);
    bool setWaitRate(const unsigned long &newWaitRate);
    bool wait();
    bool wait(const unsigned long &newWaitRate);
    bool write(const uint8_t &segments, const uint8_t &port);
    bool write(const std::string &character, const uint8_t &port);

};

//============================================================> Class declarations separator

class ClickCounter{
private:
    SevenSegDisplays _display;
    int _count{0};
    int _beginStartVal{0};
    bool _countRgthAlgn{true};
    bool _countZeroPad{false};
public:
    ClickCounter(uint8_t ccSclk, uint8_t ccRclk, uint8_t ccDio, bool rgthAlgn = true, bool zeroPad = false, bool commAnode = true, const uint8_t dspDigits = 4);
    ~ClickCounter();
    bool blink();
    bool blink(const unsigned long &onRate, const unsigned long &offRate = 0);
    void clear();
    bool countBegin(int32_t startVal = 0);  //To be analyzed it's current need
    bool countDown(int32_t qty = 1);
    bool countReset();
    bool countRestart(int32_t restartValue = 0);
    bool countStop();   //To be analyzed it's current need
    bool countToZero(int32_t qty = 1);
    bool countUp(int32_t qty = 1);
    int32_t getCount();
    int32_t getStartVal();
    bool noBlink();
    bool setBlinkRate(const unsigned long &newOnRate, const unsigned long &newOffRate = 0);
    bool updDisplay();  //To be analyzed it's current need
};

//============================================================> Class declarations separator



#endif /* _SEVENSEGDISPLAYS_STM32_H_ */
